seanmorton2023/me333/hw/hw3/pic32-libs/pic32m-libs/pic32m-libs/include/xc.h
#elif defined(__32MZ1064DAG176__) || defined(__PIC32MZ1064DAG176__)
# include <proc/PIC32MZ-DA/p32mz1064dag176.h>
#elif defined(__32MZ1064DAH169__) || defined(__PIC32MZ1064DAH169__)
# include <proc/PIC32MZ-DA/p32mz1064dah169.h>
#elif defined(__32MZ1064DAH176__) || defined(__PIC32MZ1064DAH176__)
# include <proc/PIC32MZ-DA/p32mz1064dah176.h>
#elif defined(__32MZ1064DAK169__) || defined(__PIC32MZ1064DAK169__)
# include <proc/PIC32MZ-DA/p32mz1064dak169.h>
#elif defined(__32MZ1064DAK176__) || defined(__PIC32MZ1064DAK176__)
# include <proc/PIC32MZ-DA/p32mz1064dak176.h>
#elif defined(__32MZ1064DAL169__) || defined(__PIC32MZ1064DAL169__)
# include <proc/PIC32MZ-DA/p32mz1064dal169.h>
#elif defined(__32MZ1064DAL176__) || defined(__PIC32MZ1064DAL176__)
# include <proc/PIC32MZ-DA/p32mz1064dal176.h>
#elif defined(__32MZ1064DAR169__) || defined(__PIC32MZ1064DAR169__)
# include <proc/PIC32MZ-DA/p32mz1064dar169.h>
#elif defined(__32MZ1064DAR176__) || defined(__PIC32MZ1064DAR176__)
# include <proc/PIC32MZ-DA/p32mz1064dar176.h>
#elif defined(__32MZ1064DAS169__) || defined(__PIC32MZ1064DAS169__)
# include <proc/PIC32MZ-DA/p32mz1064das169.h>
#elif defined(__32MZ1064DAS176__) || defined(__PIC32MZ1064DAS176__)
# include <proc/PIC32MZ-DA/p32mz1064das176.h>
#elif defined(__32MZ2025DAA169__) || defined(__PIC32MZ2025DAA169__)
# include <proc/PIC32MZ-DA/p32mz2025daa169.h>
#elif defined(__32MZ2025DAA176__) || defined(__PIC32MZ2025DAA176__)
# include <proc/PIC32MZ-DA/p32mz2025daa176.h>
#elif defined(__32MZ2025DAA288__) || defined(__PIC32MZ2025DAA288__)
# include <proc/PIC32MZ-DA/p32mz2025daa288.h>
#elif defined(__32MZ2025DAB169__) || defined(__PIC32MZ2025DAB169__)
# include <proc/PIC32MZ-DA/p32mz2025dab169.h>
#elif defined(__32MZ2025DAB176__) || defined(__PIC32MZ2025DAB176__)
# include <proc/PIC32MZ-DA/p32mz2025dab176.h>
#elif defined(__32MZ2025DAB288__) || defined(__PIC32MZ2025DAB288__)
# include <proc/PIC32MZ-DA/p32mz2025dab288.h>
#elif defined(__32MZ2025DAG169__) || defined(__PIC32MZ2025DAG169__)
# include <proc/PIC32MZ-DA/p32mz2025dag169.h>
#elif defined(__32MZ2025DAG176__) || defined(__PIC32MZ2025DAG176__)
# include <proc/PIC32MZ-DA/p32mz2025dag176.h>
#elif defined(__32MZ2025DAH169__) || defined(__PIC32MZ2025DAH169__)
# include <proc/PIC32MZ-DA/p32mz2025dah169.h>
#elif defined(__32MZ2025DAH176__) || defined(__PIC32MZ2025DAH176__)
# include <proc/PIC32MZ-DA/p32mz2025dah176.h>
#elif defined(__32MZ2025DAK169__) || defined(__PIC32MZ2025DAK169__)
# include <proc/PIC32MZ-DA/p32mz2025dak169.h>
#elif defined(__32MZ2025DAK176__) || defined(__PIC32MZ2025DAK176__)
# include <proc/PIC32MZ-DA/p32mz2025dak176.h>
#elif defined(__32MZ2025DAL169__) || defined(__PIC32MZ2025DAL169__)
# include <proc/PIC32MZ-DA/p32mz2025dal169.h>
#elif defined(__32MZ2025DAL176__) || defined(__PIC32MZ2025DAL176__)
# include <proc/PIC32MZ-DA/p32mz2025dal176.h>
#elif defined(__32MZ2025DAR169__) || defined(__PIC32MZ2025DAR169__)
# include <proc/PIC32MZ-DA/p32mz2025dar169.h>
#elif defined(__32MZ2025DAR176__) || defined(__PIC32MZ2025DAR176__)
# include <proc/PIC32MZ-DA/p32mz2025dar176.h>
#elif defined(__32MZ2025DAS169__) || defined(__PIC32MZ2025DAS169__)
# include <proc/PIC32MZ-DA/p32mz2025das169.h>
#elif defined(__32MZ2025DAS176__) || defined(__PIC32MZ2025DAS176__)
# include <proc/PIC32MZ-DA/p32mz2025das176.h>
#elif defined(__32MZ2064DAA169__) || defined(__PIC32MZ2064DAA169__)
# include <proc/PIC32MZ-DA/p32mz2064daa169.h>
#elif defined(__32MZ2064DAA176__) || defined(__PIC32MZ2064DAA176__)
# include <proc/PIC32MZ-DA/p32mz2064daa176.h>
#elif defined(__32MZ2064DAA288__) || defined(__PIC32MZ2064DAA288__)
# include <proc/PIC32MZ-DA/p32mz2064daa288.h>
#elif defined(__32MZ2064DAB169__) || defined(__PIC32MZ2064DAB169__)
# include <proc/PIC32MZ-DA/p32mz2064dab169.h>
#elif defined(__32MZ2064DAB176__) || defined(__PIC32MZ2064DAB176__)
# include <proc/PIC32MZ-DA/p32mz2064dab176.h>
#elif defined(__32MZ2064DAB288__) || defined(__PIC32MZ2064DAB288__)
# include <proc/PIC32MZ-DA/p32mz2064dab288.h>
#elif defined(__32MZ2064DAG169__) || defined(__PIC32MZ2064DAG169__)
# include <proc/PIC32MZ-DA/p32mz2064dag169.h>
#elif defined(__32MZ2064DAG176__) || defined(__PIC32MZ2064DAG176__)
# include <proc/PIC32MZ-DA/p32mz2064dag176.h>
#elif defined(__32MZ2064DAH169__) || defined(__PIC32MZ2064DAH169__)
# include <proc/PIC32MZ-DA/p32mz2064dah169.h>
#elif defined(__32MZ2064DAH176__) || defined(__PIC32MZ2064DAH176__)
# include <proc/PIC32MZ-DA/p32mz2064dah176.h>
#elif defined(__32MZ2064DAK169__) || defined(__PIC32MZ2064DAK169__)
# include <proc/PIC32MZ-DA/p32mz2064dak169.h>
#elif defined(__32MZ2064DAK176__) || defined(__PIC32MZ2064DAK176__)
# include <proc/PIC32MZ-DA/p32mz2064dak176.h>
#elif defined(__32MZ2064DAL169__) || defined(__PIC32MZ2064DAL169__)
# include <proc/PIC32MZ-DA/p32mz2064dal169.h>
#elif defined(__32MZ2064DAL176__) || defined(__PIC32MZ2064DAL176__)
# include <proc/PIC32MZ-DA/p32mz2064dal176.h>
#elif defined(__32MZ2064DAR169__) || defined(__PIC32MZ2064DAR169__)
# include <proc/PIC32MZ-DA/p32mz2064dar169.h>
#elif defined(__32MZ2064DAR176__) || defined(__PIC32MZ2064DAR176__)
# include <proc/PIC32MZ-DA/p32mz2064dar176.h>
#elif defined(__32MZ2064DAS169__) || defined(__PIC32MZ2064DAS169__)
# include <proc/PIC32MZ-DA/p32mz2064das169.h>
#elif defined(__32MZ2064DAS176__) || defined(__PIC32MZ2064DAS176__)
# include <proc/PIC32MZ-DA/p32mz2064das176.h>
/* PIC32MZ-EC */
#elif defined(__32MZ1024ECG064__) || defined(__PIC32MZ1024ECG064__)
# include <proc/PIC32MZ-EC/p32mz1024ecg064.h>
#elif defined(__32MZ1024ECG100__) || defined(__PIC32MZ1024ECG100__)
# include <proc/PIC32MZ-EC/p32mz1024ecg100.h>
#elif defined(__32MZ1024ECG124__) || defined(__PIC32MZ1024ECG124__)
# include <proc/PIC32MZ-EC/p32mz1024ecg124.h>
#elif defined(__32MZ1024ECG144__) || defined(__PIC32MZ1024ECG144__)
# include <proc/PIC32MZ-EC/p32mz1024ecg144.h>
#elif defined(__32MZ1024ECH064__) || defined(__PIC32MZ1024ECH064__)
# include <proc/PIC32MZ-EC/p32mz1024ech064.h>
#elif defined(__32MZ1024ECH100__) || defined(__PIC32MZ1024ECH100__)
# include <proc/PIC32MZ-EC/p32mz1024ech100.h>
#elif defined(__32MZ1024ECH124__) || defined(__PIC32MZ1024ECH124__)
# include <proc/PIC32MZ-EC/p32mz1024ech124.h>
#elif defined(__32MZ1024ECH144__) || defined(__PIC32MZ1024ECH144__)
# include <proc/PIC32MZ-EC/p32mz1024ech144.h>
#elif defined(__32MZ1024ECM064__) || defined(__PIC32MZ1024ECM064__)
# include <proc/PIC32MZ-EC/p32mz1024ecm064.h>
#elif defined(__32MZ1024ECM100__) || defined(__PIC32MZ1024ECM100__)
# include <proc/PIC32MZ-EC/p32mz1024ecm100.h>
#elif defined(__32MZ1024ECM124__) || defined(__PIC32MZ1024ECM124__)
# include <proc/PIC32MZ-EC/p32mz1024ecm124.h>
#elif defined(__32MZ1024ECM144__) || defined(__PIC32MZ1024ECM144__)
# include <proc/PIC32MZ-EC/p32mz1024ecm144.h>
#elif defined(__32MZ2048ECG064__) || defined(__PIC32MZ2048ECG064__)
# include <proc/PIC32MZ-EC/p32mz2048ecg064.h>
#elif defined(__32MZ2048ECG100__) || defined(__PIC32MZ2048ECG100__)
# include <proc/PIC32MZ-EC/p32mz2048ecg100.h>
#elif defined(__32MZ2048ECG124__) || defined(__PIC32MZ2048ECG124__)
# include <proc/PIC32MZ-EC/p32mz2048ecg124.h>
#elif defined(__32MZ2048ECG144__) || defined(__PIC32MZ2048ECG144__)
# include <proc/PIC32MZ-EC/p32mz2048ecg144.h>
#elif defined(__32MZ2048ECH064__) || defined(__PIC32MZ2048ECH064__)
# include <proc/PIC32MZ-EC/p32mz2048ech064.h>
#elif defined(__32MZ2048ECH100__) || defined(__PIC32MZ2048ECH100__)
# include <proc/PIC32MZ-EC/p32mz2048ech100.h>
#elif defined(__32MZ2048ECH124__) || defined(__PIC32MZ2048ECH124__)
# include <proc/PIC32MZ-EC/p32mz2048ech124.h>
#elif defined(__32MZ2048ECH144__) || defined(__PIC32MZ2048ECH144__)
# include <proc/PIC32MZ-EC/p32mz2048ech144.h>
#elif defined(__32MZ2048ECM064__) || defined(__PIC32MZ2048ECM064__)
# include <proc/PIC32MZ-EC/p32mz2048ecm064.h>
#elif defined(__32MZ2048ECM100__) || defined(__PIC32MZ2048ECM100__)
# include <proc/PIC32MZ-EC/p32mz2048ecm100.h>
#elif defined(__32MZ2048ECM124__) || defined(__PIC32MZ2048ECM124__)
# include <proc/PIC32MZ-EC/p32mz2048ecm124.h>
#elif defined(__32MZ2048ECM144__) || defined(__PIC32MZ2048ECM144__)
# include <proc/PIC32MZ-EC/p32mz2048ecm144.h>
/* PIC32MZ-EF */
#elif defined(__32MZ0512EFE064__) || defined(__PIC32MZ0512EFE064__)
# include <proc/PIC32MZ-EF/p32mz0512efe064.h>
#elif defined(__32MZ0512EFE100__) || defined(__PIC32MZ0512EFE100__)
# include <proc/PIC32MZ-EF/p32mz0512efe100.h>
#elif defined(__32MZ0512EFE124__) || defined(__PIC32MZ0512EFE124__)
# include <proc/PIC32MZ-EF/p32mz0512efe124.h>
#elif defined(__32MZ0512EFE144__) || defined(__PIC32MZ0512EFE144__)
# include <proc/PIC32MZ-EF/p32mz0512efe144.h>
#elif defined(__32MZ0512EFF064__) || defined(__PIC32MZ0512EFF064__)
# include <proc/PIC32MZ-EF/p32mz0512eff064.h>
#elif defined(__32MZ0512EFF100__) || defined(__PIC32MZ0512EFF100__)
# include <proc/PIC32MZ-EF/p32mz0512eff100.h>
#elif defined(__32MZ0512EFF124__) || defined(__PIC32MZ0512EFF124__)
# include <proc/PIC32MZ-EF/p32mz0512eff124.h>
#elif defined(__32MZ0512EFF144__) || defined(__PIC32MZ0512EFF144__)
# include <proc/PIC32MZ-EF/p32mz0512eff144.h>
#elif defined(__32MZ0512EFK064__) || defined(__PIC32MZ0512EFK064__)
# include <proc/PIC32MZ-EF/p32mz0512efk064.h>
#elif defined(__32MZ0512EFK100__) || defined(__PIC32MZ0512EFK100__)
# include <proc/PIC32MZ-EF/p32mz0512efk100.h>
#elif defined(__32MZ0512EFK124__) || defined(__PIC32MZ0512EFK124__)
# include <proc/PIC32MZ-EF/p32mz0512efk124.h>
#elif defined(__32MZ0512EFK144__) || defined(__PIC32MZ0512EFK144__)
# include <proc/PIC32MZ-EF/p32mz0512efk144.h>
#elif defined(__32MZ1024EFE064__) || defined(__PIC32MZ1024EFE064__)
# include <proc/PIC32MZ-EF/p32mz1024efe064.h>
#elif defined(__32MZ1024EFE100__) || defined(__PIC32MZ1024EFE100__)
# include <proc/PIC32MZ-EF/p32mz1024efe100.h>
#elif defined(__32MZ1024EFE124__) || defined(__PIC32MZ1024EFE124__)
# include <proc/PIC32MZ-EF/p32mz1024efe124.h>
#elif defined(__32MZ1024EFE144__) || defined(__PIC32MZ1024EFE144__)
# include <proc/PIC32MZ-EF/p32mz1024efe144.h>
#elif defined(__32MZ1024EFF064__) || defined(__PIC32MZ1024EFF064__)
# include <proc/PIC32MZ-EF/p32mz1024eff064.h>
#elif defined(__32MZ1024EFF100__) || defined(__PIC32MZ1024EFF100__)
# include <proc/PIC32MZ-EF/p32mz1024eff100.h>
#elif defined(__32MZ1024EFF124__) || defined(__PIC32MZ1024EFF124__)
# include <proc/PIC32MZ-EF/p32mz1024eff124.h>
#elif defined(__32MZ1024EFF144__) || defined(__PIC32MZ1024EFF144__)
# include <proc/PIC32MZ-EF/p32mz1024eff144.h>
#elif defined(__32MZ1024EFG064__) || defined(__PIC32MZ1024EFG064__)
# include <proc/PIC32MZ-EF/p32mz1024efg064.h>
#elif defined(__32MZ1024EFG100__) || defined(__PIC32MZ1024EFG100__)
# include <proc/PIC32MZ-EF/p32mz1024efg100.h>
#elif defined(__32MZ1024EFG124__) || defined(__PIC32MZ1024EFG124__)
# include <proc/PIC32MZ-EF/p32mz1024efg124.h>
#elif defined(__32MZ1024EFG144__) || defined(__PIC32MZ1024EFG144__)
# include <proc/PIC32MZ-EF/p32mz1024efg144.h>
#elif defined(__32MZ1024EFH064__) || defined(__PIC32MZ1024EFH064__)
# include <proc/PIC32MZ-EF/p32mz1024efh064.h>
#elif defined(__32MZ1024EFH100__) || defined(__PIC32MZ1024EFH100__)
# include <proc/PIC32MZ-EF/p32mz1024efh100.h>
#elif defined(__32MZ1024EFH124__) || defined(__PIC32MZ1024EFH124__)
# include <proc/PIC32MZ-EF/p32mz1024efh124.h>
#elif defined(__32MZ1024EFH144__) || defined(__PIC32MZ1024EFH144__)
# include <proc/PIC32MZ-EF/p32mz1024efh144.h>
#elif defined(__32MZ1024EFK064__) || defined(__PIC32MZ1024EFK064__)
# include <proc/PIC32MZ-EF/p32mz1024efk064.h>
#elif defined(__32MZ1024EFK100__) || defined(__PIC32MZ1024EFK100__)
# include <proc/PIC32MZ-EF/p32mz1024efk100.h>
#elif defined(__32MZ1024EFK124__) || defined(__PIC32MZ1024EFK124__)
# include <proc/PIC32MZ-EF/p32mz1024efk124.h>
#elif defined(__32MZ1024EFK144__) || defined(__PIC32MZ1024EFK144__)
# include <proc/PIC32MZ-EF/p32mz1024efk144.h>
#elif defined(__32MZ1024EFM064__) || defined(__PIC32MZ1024EFM064__)
# include <proc/PIC32MZ-EF/p32mz1024efm064.h>
#elif defined(__32MZ1024EFM100__) || defined(__PIC32MZ1024EFM100__)
# include <proc/PIC32MZ-EF/p32mz1024efm100.h>
#elif defined(__32MZ1024EFM124__) || defined(__PIC32MZ1024EFM124__)
# include <proc/PIC32MZ-EF/p32mz1024efm124.h>
#elif defined(__32MZ1024EFM144__) || defined(__PIC32MZ1024EFM144__)
# include <proc/PIC32MZ-EF/p32mz1024efm144.h>
#elif defined(__32MZ2048EFG064__) || defined(__PIC32MZ2048EFG064__)
# include <proc/PIC32MZ-EF/p32mz2048efg064.h>
#elif defined(__32MZ2048EFG100__) || defined(__PIC32MZ2048EFG100__)
# include <proc/PIC32MZ-EF/p32mz2048efg100.h>
#elif defined(__32MZ2048EFG124__) || defined(__PIC32MZ2048EFG124__)
# include <proc/PIC32MZ-EF/p32mz2048efg124.h>
#elif defined(__32MZ2048EFG144__) || defined(__PIC32MZ2048EFG144__)
# include <proc/PIC32MZ-EF/p32mz2048efg144.h>
#elif defined(__32MZ2048EFH064__) || defined(__PIC32MZ2048EFH064__)
# include <proc/PIC32MZ-EF/p32mz2048efh064.h>
#elif defined(__32MZ2048EFH100__) || defined(__PIC32MZ2048EFH100__)
# include <proc/PIC32MZ-EF/p32mz2048efh100.h>
#elif defined(__32MZ2048EFH124__) || defined(__PIC32MZ2048EFH124__)
# include <proc/PIC32MZ-EF/p32mz2048efh124.h>
#elif defined(__32MZ2048EFH144__) || defined(__PIC32MZ2048EFH144__)
# include <proc/PIC32MZ-EF/p32mz2048efh144.h>
#elif defined(__32MZ2048EFM064__) || defined(__PIC32MZ2048EFM064__)
# include <proc/PIC32MZ-EF/p32mz2048efm064.h>
#elif defined(__32MZ2048EFM100__) || defined(__PIC32MZ2048EFM100__)
# include <proc/PIC32MZ-EF/p32mz2048efm100.h>
#elif defined(__32MZ2048EFM124__) || defined(__PIC32MZ2048EFM124__)
# include <proc/PIC32MZ-EF/p32mz2048efm124.h>
#elif defined(__32MZ2048EFM144__) || defined(__PIC32MZ2048EFM144__)
# include <proc/PIC32MZ-EF/p32mz2048efm144.h>
/* PIC32MZ-W */
#elif defined(__32MZ1025W104132__) || defined(__PIC32MZ1025W104132__)
# include <proc/PIC32MZ-W/p32mz1025w104132.h>
#elif defined(__32MXGENERIC__)
#  include <proc/p32mxgeneric.h>
#else
#  error Unknown processor!
#endif

#ifdef __LANGUAGE_ASSEMBLY__
/*
 * Conventional register names.
 */

